tests/performance/main.yml
config:
  processor: "./helper.js"
  http:
    timeout: 60000
  target: "https://orleans-playground-service.test.aelf.dev"
  phases:
    - duration: 10
      arrivalRate: 5 # Start with 5 requests per second
scenarios:
  - flow:
      - post:
          url: "/playground/build"
          formData:
            file:
              fromFile: "./Archive.zip"